{
  "jobs": [
    {
      "code": "Blue-DOME",
      "company": "Blue DOME Technologies",
      "title": "Software Engineering Intern",
      "location": "San Francisco, CA",
      "startMonth": "July",
      "startYear": "2019",
      "endMonth": "September",
      "endYear": "2019",
      "description": "Researched image processing techniques to improve detection and recognition of text in images. I successfully found and implemented mehods to account for differences in lighting, perspective, color and quality and helped developed a text dectection model. Developed a custom program to split ML datasets into testing and training data. Researched and implemented a service to stream video files to a server and process the video while simultaneously downloading it. Researched ways to deduplicate results from the ML models; specifically finding ways to recognize that an object has already been recognized."
    },
    {
      "code": "UCLA-IT",
      "company": "UCLA IT Services",
      "title": "Bruin Online Consultant",
      "location": "Los Angeles, CA",
      "startMonth": "September",
      "startYear": "2019",
      "endMonth": "now",
      "endYear": null,
      "description": "Provide primary support for clients at Bruin Online (BOL)"
    },
    {
      "code": "Racing",
      "company": "Bruin Racing",
      "title": "FSAE Electronics & Data Acquisition Team",
      "location": "Los Angeles",
      "startMonth": "September",
      "startYear": "2018",
      "endMonth": "now",
      "endYear": null,
      "description": "Assisting in the design and implementation of electrical systems of the vehicle. Also working on improving the dashboard to increase the accuracy and amount of information displayed."
    },
    {
      "code": "ESRI-2",
      "company": "ESRI",
      "title": "Software Engineering Intern",
      "location": "UAE",
      "startMonth": "July",
      "startYear": "2017",
      "endMonth": "August",
      "endYear": "2017",
      "description": "Created drivers to add support for new file types in ArcGIS. Used GDAL to create an automated testing script to test support for different image file types and log the results. Also worked on enhancing the performance of the script and significantly reducing runtime."
    },
    {
      "code": "ESRI-1",
      "company": "ESRI",
      "title": "Software Engineering Intern",
      "location": "UAE",
      "startMonth": "July",
      "startYear": "2016",
      "endMonth": "August",
      "endYear": "2016",
      "description": "Designed UI elements for windows in ArcGIS"
    }
  ]
}
